QuantumLeaps/qpc/3rd_party/ek-lm3s6965/rit128x96x4.c
    //
    // Setup a window starting at the specified column and row, and ending
    // at the column + width and row+height.
    //
    g_pucBuffer[0] = 0x15;
    g_pucBuffer[1] = ulX / 2;
    g_pucBuffer[2] = (ulX + ulWidth - 2) / 2;
    RITWriteCommand(g_pucBuffer, 3);
    g_pucBuffer[0] = 0x75;
    g_pucBuffer[1] = ulY;
    g_pucBuffer[2] = ulY + ulHeight - 1;
    RITWriteCommand(g_pucBuffer, 3);
    RITWriteCommand(g_pucRIT128x96x4HorizontalInc,
                    sizeof(g_pucRIT128x96x4HorizontalInc));

    //
    // Loop while there are more rows to display.
    //
    while(ulHeight--)
    {
        //
        // Write this row of image data.
        //
        RITWriteData(pucImage, (ulWidth / 2));

        //
        // Advance to the next row of the image.
        //
        pucImage += (ulWidth / 2);
    }
}

//============================================================================*
//
//! Enable the SSI component of the OLED display driver.
//!
//! \param ulFrequency specifies the SSI Clock Frequency to be used.
//!
//! This function initializes the SSI interface to the OLED display.
//!
//! This function is contained in <tt>rit128x96x4.c</tt>, with
//! <tt>rit128x96x4.h</tt> containing the API definition for use by
//! applications.
//!
//! \return None.
//
//============================================================================*
void
RIT128x96x4Enable(unsigned long ulFrequency)
{
    unsigned long ulTemp;
    unsigned long ulPreDiv;
    unsigned long ulSCR;

    //
    // Disable the SSI port.
    //
    SSI0->CR1 &= ~(1 << 1);

    //
    // Configure the SSI0 port for master mode.
    //
    SSI0->CR1 = 0;
    ulTemp = SystemCoreClock / ulFrequency;
    ulPreDiv = 0;
    do {
        ulPreDiv += 2;
        ulSCR = (ulTemp / ulPreDiv) - 1;
    }
    while (ulSCR > 255);
    SSI0->CPSR = ulPreDiv;
    SSI0->CR0  = (ulSCR << 8) | (1 << 6) | (8 - 1);

    //
    // (Re)Enable SSI control of the FSS pin.
    //
    GPIOA->DIR   &= ~GPIO_OLEDFSS_PIN;
    GPIOA->AFSEL |=  GPIO_OLEDFSS_PIN;
    GPIOA->DR8R  |=  GPIO_OLEDFSS_PIN;    // 8mA strength
    GPIOA->ODR   &= ~GPIO_OLEDFSS_PIN;
    GPIOA->PUR   |=  GPIO_OLEDFSS_PIN;
    GPIOA->PDR   &= ~GPIO_OLEDFSS_PIN;
    GPIOA->DEN   |=  GPIO_OLEDFSS_PIN;

    //
    // Enable the SSI port.
    //
    SSI0->CR1 |= (1 << 1);

    //
    // Drain the receive fifo.
    //
    while((SSI0->SR & (1 << 2)) != 0)
    {
    }
    ulTemp = SSI0->DR;

    //
    // Indicate that the RIT driver can use the SSI Port.
    //
    g_bSSIEnabled = 1;
}

//============================================================================*
//
//! Enable the SSI component of the OLED display driver.
//!
//! This function initializes the SSI interface to the OLED display.
//!
//! This function is contained in <tt>rit128x96x4.c</tt>, with
//! <tt>rit128x96x4.h</tt> containing the API definition for use by
//! applications.
//!
//! \return None.
//
//============================================================================*
void
RIT128x96x4Disable(void)
{
    volatile unsigned long ulTemp;

    //
    // Indicate that the RIT driver can no longer use the SSI Port.
    //
    g_bSSIEnabled = 0;

    //
    // Drain the receive fifo.
    //
    while((SSI0->SR & (1 << 2)) != 0)
    {
    }
    ulTemp = SSI0->DR;

    //
    // Disable the SSI port.
    //
    SSI0->CR1 &= ~(1 << 1);

    //
    // Disable SSI control of the FSS pin.
    //
    GPIOA->DIR   |=  GPIO_OLEDFSS_PIN;
    GPIOA->AFSEL &= ~GPIO_OLEDFSS_PIN;
    GPIOA->DR8R  |=  GPIO_OLEDFSS_PIN;    // 8mA strength
    GPIOA->ODR   &= ~GPIO_OLEDFSS_PIN;
    GPIOA->PUR   |=  GPIO_OLEDFSS_PIN;
    GPIOA->PDR   &= ~GPIO_OLEDFSS_PIN;
    GPIOA->DEN   |=  GPIO_OLEDFSS_PIN;
    GPIOA->AMSEL &= ~GPIO_OLEDFSS_PIN;

    GPIOA->DATA_Bits[GPIO_OLEDFSS_PIN] = GPIO_OLEDFSS_PIN;
}

//============================================================================*
//
//! Initialize the OLED display.
//!
//! \param ulFrequency specifies the SSI Clock Frequency to be used.
//!
//! This function initializes the SSI interface to the OLED display and
//! configures the SSD1329 controller on the panel.
//!
//! This function is contained in <tt>rit128x96x4.c</tt>, with
//! <tt>rit128x96x4.h</tt> containing the API definition for use by
//! applications.
//!
//! \return None.
//
//============================================================================*
void
RIT128x96x4Init(unsigned long ulFrequency)
{
    unsigned long ulPins;
    unsigned long ulIdx;

    //
    // Enable the SSI0 and GPIO port blocks as they are needed by this driver.
    //
    SYSCTL->RCGC1 |= (1 <<  4);                    /* enable clock to SSI0  */
    SYSCTL->RCGC2 |= (1 <<  0);                    /* enable clock to GPIOA */
    SYSCTL->RCGC2 |= (1 <<  2);                    /* enable clock to GPIOC */

    //
    // Configure the SSI0CLK and SSIOTX pins for SSI operation.
    //
    ulPins = (1 << 2) | (1 << 3) | (1 << 5);
    GPIOA->DIR   &= ~ulPins;
    GPIOA->AFSEL |=  ulPins;
    GPIOA->DR8R  |=  ulPins;    // 8mA strength
    GPIOA->ODR   &= ~ulPins;
    GPIOA->PUR   |=  ulPins;
    GPIOA->PDR   &= ~ulPins;
    GPIOA->DEN   |=  ulPins;
    GPIOA->AMSEL &= ~ulPins;

    //
    // Configure the GPIO port pin used as a D/Cn signal for OLED device,
    // and the port pin used to enable power to the OLED panel.
    //
    ulPins = GPIO_OLEDDC_PIN | GPIO_OLEDEN_PIN;
    GPIOC->DIR   |=  ulPins;
    GPIOC->AFSEL &= ~ulPins;
    GPIOC->DR8R  |=  ulPins;    // 8mA strength
    GPIOC->ODR   &= ~ulPins;
    GPIOC->PUR   &= ~ulPins;
    GPIOC->PDR   &= ~ulPins;
    GPIOC->DEN   |=  ulPins;
    GPIOC->AMSEL &= ~ulPins;

    GPIOC->DATA_Bits[ulPins] = ulPins;

    //
    // Configure and enable the SSI0 port for master mode.
    //
    RIT128x96x4Enable(ulFrequency);

    //
    // Clear the frame buffer.
    //
    RIT128x96x4Clear();

    //
    // Initialize the SSD1329 controller.  Loop through the initialization
    // sequence array, sending each command "string" to the controller.
    //
    for(ulIdx = 0; ulIdx < sizeof(g_pucRIT128x96x4Init);
        ulIdx += g_pucRIT128x96x4Init[ulIdx] + 1)
    {
        //
        // Send this command.
        //
        RITWriteCommand(g_pucRIT128x96x4Init + ulIdx + 1,
                        g_pucRIT128x96x4Init[ulIdx] - 1);
    }
}

//============================================================================*
//
//! Turns on the OLED display.
//!
//! This function will turn on the OLED display, causing it to display the
//! contents of its internal frame buffer.
//!
//! This function is contained in <tt>rit128x96x4.c</tt>, with
//! <tt>rit128x96x4.h</tt> containing the API definition for use by
//! applications.
//!
//! \return None.
//
//============================================================================*
void
RIT128x96x4DisplayOn(void)
{
    unsigned long ulIdx;

    //
    // Initialize the SSD1329 controller.  Loop through the initialization
    // sequence array, sending each command "string" to the controller.
    //
    for(ulIdx = 0; ulIdx < sizeof(g_pucRIT128x96x4Init);
        ulIdx += g_pucRIT128x96x4Init[ulIdx] + 1)
    {
        //
        // Send this command.
        //
        RITWriteCommand(g_pucRIT128x96x4Init + ulIdx + 1,
                        g_pucRIT128x96x4Init[ulIdx] - 1);
    }
}

//============================================================================*
//
//! Turns off the OLED display.
//!
//! This function will turn off the OLED display.  This will stop the scanning
//! of the panel and turn off the on-chip DC-DC converter, preventing damage to
//! the panel due to burn-in (it has similar characters to a CRT in this
//! respect).
//!
//! This function is contained in <tt>rit128x96x4.c</tt>, with
//! <tt>rit128x96x4.h</tt> containing the API definition for use by
//! applications.
//!
//! \return None.
//
//============================================================================*
void
RIT128x96x4DisplayOff(void)
{
    static const unsigned char pucCommand1[] =
    {
        0xAE, 0xe3
    };

    //
    // Put the display to sleep.
    //
    RITWriteCommand(pucCommand1, sizeof(pucCommand1));
}

//============================================================================*
//
// Close the Doxygen group.
//! @}
//
//============================================================================*

